Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMGZmNzkwNS1hMGUwLTQ2Y2UtYjVlYy04ZDQ5MTcwZjQ0ZGY7b2JqZWN0SWQ9Y2VlMDM3MzYtZjZkYi00YzM0LTg4NTMtOGRjZWE0MjI4MzdmO3N1YnNjcmlwdGlvbklkPTc3MzU4NmFkLWJiMzgtNGQ0NS04YzUwLWU0YTNiYjIwMjFjODt0ZW5hbnRJZD1kMGUxYTc2ZS02NWYxLTQ0YWYtYWQyNy1lMzk2OTc2MWUxYTg=]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_resource_group.primary has been deleted
- resource "azurerm_resource_group" "primary" {
        id         = "/subscriptions/773586ad-bb38-4d45-8c50-e4a3bb2021c8/resourceGroups/rg-test-poc"
      - location   = "northeurope" -> null
      - name       = "rg-test-poc" -> null
        tags       = {
            "Environment" = "poc"
            "ManagedBy"   = "Terraform"
            "Project"     = "test"
        }
        # (1 unchanged attribute hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # azurerm_resource_group.primary will be created
+ resource "azurerm_resource_group" "primary" {
      + id       = (known after apply)
      + location = "southindia"
      + name     = "rg-test-poc"
      + tags     = {
          + "Environment" = "poc"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "test"
        }
    }

  # azurerm_subnet.snet will be created
+ resource "azurerm_subnet" "snet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled                = true
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "snet-compute-01"
      + private_endpoint_network_policies              = (known after apply)
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg-test-poc"
      + virtual_network_name                           = "vnet-test-poc"
    }

  # azurerm_virtual_network.vnet will be created
+ resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "southindia"
      + name                = "vnet-test-poc"
      + resource_group_name = "rg-test-poc"
      + subnet              = (known after apply)
    }

  # random_password.vm_admin will be created
+ resource "random_password" "vm_admin" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 16
      + lower            = true
      + min_lower        = 2
      + min_numeric      = 2
      + min_special      = 0
      + min_upper        = 2
      + number           = true
      + numeric          = true
      + override_special = "!#$%&*()-_=+[]{}<>:?"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.keyvault.azurerm_key_vault.kv will be created
+ resource "azurerm_key_vault" "kv" {
      + access_policy                 = [
          + {
              + key_permissions    = [
                  + "Get",
                  + "List",
                  + "Create",
                  + "Delete",
                  + "Update",
                ]
              + object_id          = "cee03736-f6db-4c34-8853-8dcea422837f"
              + secret_permissions = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Recover",
                  + "Backup",
                  + "Restore",
                  + "Purge",
                ]
              + tenant_id          = "d0e1a76e-65f1-44af-ad27-e3969761e1a8"
            },
        ]
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "southindia"
      + name                          = "kv-test-poc-01"
      + public_network_access_enabled = true
      + purge_protection_enabled      = false
      + resource_group_name           = "rg-test-poc"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tenant_id                     = "d0e1a76e-65f1-44af-ad27-e3969761e1a8"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # module.keyvault.azurerm_key_vault_secret.vm_pass will be created
+ resource "azurerm_key_vault_secret" "vm_pass" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "vm-admin-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.linux_vm.azurerm_linux_virtual_machine.vm_linux[0] will be created
+ resource "azurerm_linux_virtual_machine" "vm_linux" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "adminusers"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = false
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "southindia"
      + max_bid_price                                          = -1
      + name                                                   = "vm-test-web"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-test-poc"
      + size                                                   = "Standard_B2ats_v2"
      + tags                                                   = {
          + "Environment" = "poc"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "test"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 128
          + name                      = "osdisk-web-01"
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }

      + termination_notification (known after apply)
    }

  # module.linux_vm.azurerm_network_interface.nic[0] will be created
+ resource "azurerm_network_interface" "nic" {
      + accelerated_networking_enabled = (known after apply)
      + applied_dns_servers            = (known after apply)
      + dns_servers                    = (known after apply)
      + enable_accelerated_networking  = (known after apply)
      + enable_ip_forwarding           = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = (known after apply)
      + location                       = "southindia"
      + mac_address                    = (known after apply)
      + name                           = "vm-test-web-nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "rg-test-poc"
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ vm_private_ip  = (known after apply)
Releasing state lock. This may take a few moments...
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://20.120.224.7:4141/lock?id=SilverFoxDevOps%252Fterraform_project%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```

**Note: Objects have changed outside of Terraform**
Plan: 8 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```